 000001            01  REG-CLIENTES.              
 000002                05 REG-CODIGO   PIC 9(05). 
 000003                05 REG-NOME     PIC X(20). 
 000004                05 REG-ENDERECO PIC X(25). 
