//HERC01XX JOB (PROG018),             
//             'EXECUTA PROG018',     
//             CLASS=A,               
//             MSGCLASS=H,            
//             REGION=8M,TIME=1440,   
//             MSGLEVEL=(1,1),        
//             NOTIFY=HERC01          
//COMPILA  EXEC COBOL,                
//         PROG='PROG018',            
//         BIBF='HERC01.LIBS.COBOL',  
//         BIBC='HERC01.LIBS.LOAD'    
