000001        IDENTIFICATION                  DIVISION.
000002        PROGRAM-ID. PROG001.                     
000003        ENVIRONMENT                     DIVISION.
000004        DATA                            DIVISION.
000005        WORKING-STORAGE                 SECTION. 
000006        PROCEDURE                       DIVISION.
000007           DISPLAY 'PRIMEIRO PROGRAMA'.          
000008           STOP RUN.                             
000009                                                 
